# Pandas 시작- 파일을 DataFrame 로딩, 기본 API
**read_csv()**  
read_csv()를 이용하여 csv 파일을 편리하게 DataFrame으로 로딩합니다.   
read_csv() 의 sep 인자를 콤마(,)가 아닌 다른 분리자로 변경하여 다른 유형의 파일도 로드가 가능합니다.

In [1]:
import pandas as pd

In [2]:
titanic_df = pd.read_csv("../04.Pandas/data/titanic_train.csv")
print('titanic 변수 type : ', type(titanic_df))

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

In [4]:
# 데이터프레임의 낸 앞 일부만 추출
# 모든 값들이 배열로 되어있다.(ndarray)
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# 0부터 891까지의 인덱스를 가짐
# 물리적으로 값을 가지고 PK인덱스라고 이해함.
titanic_df.index, type(titanic_df.index)

(RangeIndex(start=0, stop=891, step=1), pandas.core.indexes.range.RangeIndex)

In [46]:
print('DataFrame크기 : ', titanic_df.shape)

DataFrame크기 :  (891, 12)

In [48]:
# DataFrame의 컬럼,널값 개수, 데이터타입
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [49]:
# 데이터의  기본적인 통계치
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### DataFrame 생성

In [12]:
dic1 = {
    'Name':['Chulmin', 'EnuKyung', 'Jinwoong', 'Soobeom'],
    'Year':[2011, 2016, 2015, 2015],
    'Gender':['Male', 'Female', 'Male', 'Male']
}

# 딕셔너리를 DataFrame으로 변환
data_df = pd.DataFrame(dic1)
display(data_df)
print("#"* 30)

#새로운 컬럼명을 추가하면 해당 값은 NaN값으로 초기화
data_df = pd.DataFrame(dic1, columns=['Name', 'Year', 'Gender' ,'Age'])
display(data_df)
print("#"* 30)

# 인덱스를 새로운 값으로 할당
data_df = pd.DataFrame(dic1, index = ['one', 'two', 'three', 'four'])
display(data_df)
print("#"* 30)

       Name  Year  Gender
0   Chulmin  2011    Male
1  EnuKyung  2016  Female
2  Jinwoong  2015    Male
3   Soobeom  2015    Male

##############################

       Name  Year  Gender  Age
0   Chulmin  2011    Male  NaN
1  EnuKyung  2016  Female  NaN
2  Jinwoong  2015    Male  NaN
3   Soobeom  2015    Male  NaN

##############################

           Name  Year  Gender
one     Chulmin  2011    Male
two    EnuKyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

##############################

#### DataFrame의 컬럼명과 인덱스

In [13]:
print("Columns : ", titanic_df.columns)
print("Index : ", titanic_df.index)
print("Index value : ", titanic_df.index.values)

Columns :  Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index :  RangeIndex(start=0, stop=891, step=1)
Index value :  [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

#### DataFrame에서 Series추출 및 DataFrame필터링 추출

In [20]:
series = titanic_df['Name']
print(series.head(3))
print("## type : ", type(series))

# 데이터프레임에서 []연산자에 내에 여러 개의 컬럼을 리스트로 입력하면 그 컬럼들로 구성된 DataFrame을 반환
filtered_df = titanic_df[['Name', 'Age']]
print(filtered_df.head(3))
print("Type : ", type(filtered_df))

#데이터프레임에서 []연산자내에 한 개의 컬럼을 명시하면 그 컬럼만으로 구성된 DataFrame을 리턴
one_col_df = titanic_df[['Name']]
print(one_col_df.head(3))
print("Type : ", type(one_col_df))

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
Name: Name, dtype: object
## type :  <class 'pandas.core.series.Series'>
                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
Type :  <class 'pandas.core.frame.DataFrame'>
                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
Type :  <class 'pandas.core.frame.DataFrame'>

#### shape
* 데이터프레임의 열(column)과 행(row)값을 갖는 속성

In [23]:
print('데이터 프레임 크기  : ', titanic_df.shape)

데이터 프레임 크기  :  (891, 12)

#### info()
* memory_usage : 메모리에 올라가는 양
* 데이터 프레임내의 컬럼명, 데이터 타입, 널건수, 데이터 건수 정보를 제공

In [25]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##### Describe()
* 데이터 값들의 분포, 4분위 분포도, 표준편차, 숫자형 컬럼들에 대해서만 통계정보 제공

In [26]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### value_counts()
* 특정 컬럼 값의 분포도를 확인해볼때.
- 해당 칼럼값의 유형과 건수 확인

동일한 개별 데이터 값이 몇건이 있는지 정보를 제공합니다. 즉 개별 데이터값의 분포도를 제공합니다. 주의할 점은 value_counts()는 Series객체에서만 호출 될 수 있으므로 반드시 DataFrame을 단일 컬럼으로 입력하여 Series로 변환한 뒤 호출합니다.(반드시, 시리즈 만든후 확인해야 함)

In [53]:
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [27]:
titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))  # 인덱스와 단 하나의 컬럼으로 구성된 것.

<class 'pandas.core.series.Series'>

In [55]:
# 시리즈의 구성된 값 보기 
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [57]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

#### sort_values()

by=정렬컬럼, ascending=True 또는 False로 오름차순/내림차순으로 정렬

In [28]:
titanic_df.sort_values(by='Pclass', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
511,512,0,3,"Webber, Mr. James",male,NaN,0,0,SOTON/OQ 3101316,8.0500,NaN,S
500,501,0,3,"Calic, Mr. Petar",male,17.0,0,0,315086,8.6625,NaN,S
501,502,0,3,"Canavan, Miss. Mary",female,21.0,0,0,364846,7.7500,NaN,Q
502,503,0,3,"O'Sullivan, Miss. Bridget Mary",female,NaN,0,0,330909,7.6292,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
102,103,0,1,"White, Mr. Richard Frasar",male,21.0,0,1,35281,77.2875,D26,S
710,711,1,1,"Mayne, Mlle. Berthe Antonine (""Mrs de Villiers"")",female,24.0,0,0,PC 17482,49.5042,C90,C
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
712,713,1,1,"Taylor, Mr. Elmer Zebley",male,48.0,1,0,19996,52.0000,C126,S
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S

In [29]:
titanic_df.sort_values(by='Pclass', ascending=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S
310,311,1,1,"Hays, Miss. Margaret Bechstein",female,24.0,0,0,11767,83.1583,C54,C
309,310,1,1,"Francatelli, Miss. Laura Mabel",female,30.0,0,0,PC 17485,56.9292,E36,C
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
306,307,1,1,"Fleming, Miss. Margaret",female,NaN,0,0,17421,110.8833,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
379,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S
381,382,1,3,"Nakid, Miss. Maria (""Mary"")",female,1.0,0,2,2653,15.7417,NaN,C
382,383,0,3,"Tikkanen, Mr. Juho",male,32.0,0,0,STON/O 2. 3101293,7.9250,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
# Name, Age를 Age로 정렬
titanic_df[['Name','Age']].sort_values(by='Age', ascending = False)

                                         Name   Age
630      Barkworth, Mr. Algernon Henry Wilson  80.0
851                       Svensson, Mr. Johan  74.0
493                   Artagaveytia, Mr. Ramon  71.0
96                  Goldschmidt, Mr. George B  71.0
116                      Connors, Mr. Patrick  70.5
..                                        ...   ...
859                          Razi, Mr. Raihed   NaN
863         Sage, Miss. Dorothy Edith "Dolly"   NaN
868               van Melkebeke, Mr. Philemon   NaN
878                        Laleff, Mr. Kristo   NaN
888  Johnston, Miss. Catherine Helen "Carrie"   NaN

[891 rows x 2 columns]

In [31]:
titanic_df[['Name','Age','Pclass']].sort_values(by=['Pclass','Age'])

                                         Name    Age  Pclass
305            Allison, Master. Hudson Trevor   0.92       1
297              Allison, Miss. Helen Loraine   2.00       1
445                 Dodge, Master. Washington   4.00       1
802       Carter, Master. William Thornton II  11.00       1
435                 Carter, Miss. Lucile Polk  14.00       1
..                                        ...    ...     ...
859                          Razi, Mr. Raihed    NaN       3
863         Sage, Miss. Dorothy Edith "Dolly"    NaN       3
868               van Melkebeke, Mr. Philemon    NaN       3
878                        Laleff, Mr. Kristo    NaN       3
888  Johnston, Miss. Catherine Helen "Carrie"    NaN       3

[891 rows x 3 columns]

### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
- 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

In [32]:
import numpy as np
import pandas as pd

In [38]:
col_name = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print('array1 shape:', array1.shape)

array1 shape: (3,)

In [39]:
# 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns = col_name)
print('1차원 리스트로 만든 DataFrame:\n', df_list1)

1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [ ]:
# 넘파이 ndarray를 이용해 DataFrame생성
df_array1 = pd.DataFrame(array1, columns = col_name)
print('1차원 ndarray로 만든 DataFrame : \n', df_array1)

#### 2차원 형태의 데이터프레임

In [40]:
# 3개의 컬럼명
col_name2 = ['col1', 'col2', 'ol3']
list2 = [[1, 2, 3], 
         [11, 12, 13]]
array2 = np.array(list2)
print('array2 shape : ', array2.shape)

df_list2 = pd.DataFrame(list2, columns = col_name2)
print('2차원 리스트로 만든 데이터프레임 : \n', df_list2)

df_array2 = pd.DataFrame(array2, columns = col_name2)
print('2차원 ndarray로 만든 DataFrame : \n',df_array2)

array2 shape :  (2, 3)
2차원 리스트로 만든 데이터프레임 :
    col1  col2  ol3
0     1     2    3
1    11    12   13
2차원 ndarray로 만든 DataFrame :
    col1  col2  ol3
0     1     2    3
1    11    12   13

#### 딕셔너리 형태의 데이터 프레임 변환

In [43]:
# Key는 문자열 컬럼명으로 매핑, Value는 리스트 형 (또는 ndarray) 칼럼 데이터로 매핑
dict1 = {'col1':[1, 11], 'col2': [2, 22], 'col3': [3, 33]}
df_dict = pd.DataFrame(dict1)

print('딕셔너리 형태로 만든 데이터 프레임 : \n', df_dict)

딕셔너리 형태로 만든 데이터 프레임 :
    col1  col2  col3
0     1     2     3
1    11    22    33

In [42]:
dic1 = {
    'Name':['Sangseo', 'Kim', 'AhnJungKyeun', 'KimGoo'],
    'Year':[2011, 2016, 1897, 1902],
    'Gender': ['male', 'male', 'male', 'male']
}
# 딕셔너리를 데이터프레임으로 변환
data_df = pd.DataFrame(dic1)

#### DataFrame을 넘파이 ndarray, list, dictionary로 변환하기 
- 대부분의 머신러닝 패키지가 기본 데이터형으로 넘파이 ndarray를 사용하므로, 데이터 핸들링은 판다스로 하더라도 머신러닝 패키지에 인자로 던져주려면 ndarray로 변환해야 하는 경우가 다수
- **`values`** 로 ndarray타입으로 변환
- **`.tolist()`** 로 리스트로 변환
- **`to_dict()`** 로 딕셔너리로 변환

* DataFrame을 ndarry로 변환

In [47]:
df_dict.values, type(df_dict.values)

(array([[ 1,  2,  3],
        [11, 22, 33]], dtype=int64),
 numpy.ndarray)

In [48]:
array3 = df_dict.values
print('df_dict.values 타입 : ', type(array3), 'df_dict.values shape : ', array3.shape)
print(array3)

df_dict.values 타입 :  <class 'numpy.ndarray'> df_dict.values shape :  (2, 3)
[[ 1  2  3]
 [11 22 33]]

- DataFrame를 리스트로 변환

In [52]:
df_dict.values.tolist(), type(df_dict.values.tolist())

([[1, 2, 3], [11, 22, 33]], list)

In [53]:
list3 = df_dict.values.tolist()   
print('df_dic.values.tolist() 타입 : ', type(list3))
print(list3)

df_dic.values.tolist() 타입 :  <class 'list'>
[[1, 2, 3], [11, 22, 33]]

* DataFrame를 딕셔너리로 변환

In [54]:
dict3 = df_dict.to_dict()
print('\n df_dict.to_dict() 타입 : ', type(dict3))
print(dict3)

 df_dict.to_dict() 타입 :  <class 'dict'>
{'col1': {0: 1, 1: 11}, 'col2': {0: 2, 1: 22}, 'col3': {0: 3, 1: 33}}

* DataFrame을 딕셔너리로 변환 - orient옵션을 `list'

In [55]:
dict3 = df_dict.to_dict('list')
print('\n df_dict.to_dict() 타입 : ', type(dict3))
print(dict3)

 df_dict.to_dict() 타입 :  <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

###  DataFrame의 컬럼 데이터 셋 Access

DataFrame의 컬럼 데이터 세트 생성과 수정은 `[]`연산자를 이용해 쉽게 할 수 있습니다.새로운 컬럼에 값을 할당하려면 DataFrame `[]`내에 새로운 컬럼명을 입력하고 값을 할당해 주기만 하면 됩니다.

In [56]:
titanic_df = pd.read_csv("../04.Pandas/data/titanic_train.csv")

In [59]:
# 새로운 컬럼명 생성
titanic_df['Age_0'] = 0
titanic_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [61]:
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

해당 값을 업데이트하려면 아래와 같이 갱신해주면 됨

In [62]:
titanic_df['Age_by_10'] = titanic_df['Age_by_10'] + 100
titanic_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

### DataFrame 데이터 삭제

In [63]:
# 삭제한 것을 새로운 데이터프레임에 복사 
# 디폴트로 inplace=False임 - 원본데이터가 아닌 복사본에 삭제를 하고,결과를 결과를 리턴함.
titanic_drop_df = titanic_df.drop(labels = 'Age_0', axis = 1)
titanic_drop_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [64]:
# inplace = False이므로 원본에는 삭제한 컬럼이 그대로 존재함
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

여러개의 컬럼을 삭제하는 경우는 , 리스트로 컬럼을 명시해줘야 함.

In [65]:
drop_result = titanic_df.drop(labels = ['Age_0', 'Age_by_10', 'Family_No'], axis = 1, inplace=True)
print('inplace = True 로 Drop 후 반환된 값 : ', drop_result) # 원본을 변경했다는 의미로 None을 반환함

inplace = True 로 Drop 후 반환된 값 :  None

In [66]:
titanic_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### 한 가지 주의할 점
 - `inplace=True`로 설정하고 컬럼 삭제시 발생하는 현상을 알아보자.

In [67]:
titanic_df = titanic_df.drop(labels = ['Fare', 'Cabin'], axis = 1, inplace=True)

In [68]:
titanic_df.head(n=3)   # AttributeError: 'NoneType' object has no attribute 'head'

AttributeError: 'NoneType' object has no attribute 'head'

In [71]:
titanic_df = pd.read_csv("../04.Pandas/data/titanic_train.csv")
titanic_df = titanic_df.drop(labels = ['Fare', 'Cabin'], axis = 1,  inplace = False)

In [72]:
titanic_df.head(n = 3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,S

#### axis = 0으로 설정해 index 0, 1, 2(맨 앞 3개 데이터 삭제)

axis = 0일 경우, drop()은 row방향으로 데이터를 삭제합니다

In [75]:
titanic_df = pd.read_csv("../04.Pandas/data/titanic_train.csv")

In [76]:
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('### before axis 0 drop ####')
display(titanic_df.head(n = 3))
titanic_df.drop(index = [0, 1, 2], axis = 0, inplace = True)

print('### after axis 0 drop ###')
display(titanic_df.head(n = 3))

### before axis 0 drop ####

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

### after axis 0 drop ###

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

### Index 객체

In [78]:
# 원본 데이터프레임을 다시 로딩 
titanic_df = pd.read_csv('../04.Pandas/data/titanic_train.csv')

# index객체 추출
indexes = titanic_df.index
display(indexes)

# index객체를 실제 값 array로 변환
print('Inde 객체 array값 : \n', indexes.values)

RangeIndex(start=0, stop=891, step=1)

Inde 객체 array값 :
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [4]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

##### TypeError: Index does not support mutable operations

`[]`를 이용하여 임의로 인덱스를 수정불가능함.

In [5]:
indexes[0] = 6

TypeError: Index does not support mutable operations

Series객체는 Index객체를 포함하지만 Series객체에 연산 함수를 적용할 때는 Index는 연산에서 제외됩니다.
오직 Index는 식별용으로만 사용됨(Immutable한 객체)

In [79]:
series_fair = titanic_df['Fare']
print(series_fair)
print('Fair series max 값 : ', series_fair.max())
print('Fair series sum 값 : ', series_fair.sum())
print('sum() Fair Series : ',  sum(series_fair))
print('Fair series + 3: \n', (series_fair + 3).head(n = 3))

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64
Fair series max 값 :  512.3292
Fair series sum 값 :  28693.9493
sum() Fair Series :  28693.949299999967
Fair series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

###### reset_index()
* 기존 인덱스가 `index`라는 컬럼이 새로 컬럼으로 만들어지고 인덱스가 새로이 만들어짐.

In [80]:
titanic_reset_df = titanic_df.reset_index(inplace = False)
titanic_reset_df.head(n = 3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [82]:
print('### before reset_index ###')
value_counts  = titanic_df['Pclass'].value_counts()
print(value_counts)  # R의 table(데이터프레임$columnname)
print('value_counts 객체 변수 타입 : ', type(value_counts))

new_value_counts = value_counts.reset_index(inplace = False)
print('### After reset_index ####')
print(new_value_counts)
print('new_value_counts 객체 변수 타입 : ', type(new_value_counts))
display(new_value_counts)

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입 :  <class 'pandas.core.series.Series'>
### After reset_index ####
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입 :  <class 'pandas.core.frame.DataFrame'>

   index  Pclass
0      3     491
1      1     216
2      2     184

### 데이터 셀렉션 및 필터링
- DataFrame의 `[]` 연산자

넘파이에서 `[]`연산자는 행의 위치, 열의 위치, 슬라이싱 범위 등을 지정해 데이터를 가져올 수 있었습니다.
하지만 DataFrame 바로 뒤의 `[]`안에 들어갈 수 있는 것은 컬럼 명 문자(또는 컬럼 명의 리스트 객체), 또는 인덱스로 변환 가능한 표현식입니다.

In [83]:
titanic_df = pd.read_csv("../04.Pandas/data/titanic_train.csv")

In [85]:
print('단일 컬럼 데이터 추출  : \n', titanic_df['Pclass'].head(3))
print('\n 여러 컬럼의 데이터 추출:\n', titanic_df[['Survived', 'Pclass']].head(n = 3))

# 아래의 같은 방식은 가급적이면 하지말자.
print('[]안에 숫자 인덱스는 KeyError 오류 발생: \n', titanic_df[0])

단일 컬럼 데이터 추출  :
 0    3
1    1
2    3
Name: Pclass, dtype: int64

 여러 컬럼의 데이터 추출:
    Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

앞에서 DataFrame의 `[]`내에 숫자 값을 입력할 경우 오류가 발생한다고 했는데, Pandas의 Index형태로 변환 가능한 표현식은 `[]`내에 입력할 수 있습니다.
가령 titanic_df의 처음 2개 데이터를 추출하고자 `titanic_df[0:2]`와 같은 슬라이싱을 이용하였다면 정확히 원하는 결과를 반환해줍니다.

In [90]:
titanic_df[0:2]  # 웬만하면 이런 방식은 지향합시다.

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

`[]`내에 조건식을 입력하여 불린 인덱싱을 수행할 수 있습니다.(데이터프레임 바로 뒤에 들어가는 `[]`안에 들어갈 수 있는 것은 컬럼명과 불린인덱싱으로 범위를 좁혀서 코딩을 하는 것은 좋습니다)

아래와 같은 방식으로 코딩

In [87]:
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

#### DataFrame `ix[]` 연산자
- **명칭기반, 위치기반 인덱싱 둘다 지원함.(사용하지 말자)**
- `ix[0, 2]` : 인덱스가 0인 로우의 세번째 컬럼에 있는 데이터를 의미함.
- 해당 API는 Pandas 1.0.0 이후에 Deprecated되어서 더 이상 지원하지 않음.

In [88]:
# 둘 다 에러납니다.
# pandas 1.0.0 이후에 deprecated 된 API
print('칼럼 위치 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0, 2])
print('칼럼 명 기반 인덱싱 데이터 추출 : ', titanic_df.ix[0, 'Pclass'])

AttributeError: 'DataFrame' object has no attribute 'ix'

In [91]:
data = {
        'Name': ["Chulmin", "Enykung", "Jinwoong", "Seobum"],
        "Year": [2011, 2016, 2015, 2015],
        "Gender": ["Male", "Female", "Male", "Male"]
}

data_df = pd.DataFrame(data, index = ['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two     Enykung  2016  Female
three  Jinwoong  2015    Male
four     Seobum  2015    Male

In [93]:
print(data_df.ix[0, 0])  # 더 이상 지원하지 않음.

AttributeError: 'DataFrame' object has no attribute 'ix'

In [94]:
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two     Enykung  2016  Female
three  Jinwoong  2015    Male
four     Seobum  2015    Male

In [118]:
# data_df를 reset_index()로 새로운숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()

In [119]:
data_df_reset

   index      Name  Year  Gender
0    one   Chulmin  2011    Male
1    two   Enykung  2016  Female
2  three  Jinwoong  2015    Male
3   four    Seobum  2015    Male

In [120]:
# 컬럼명 변경
data_df_reset = data_df_reset.rename(columns={"index":"oldIndex"})
display(data_df_reset)

  oldIndex      Name  Year  Gender
0      one   Chulmin  2011    Male
1      two   Enykung  2016  Female
2    three  Jinwoong  2015    Male
3     four    Seobum  2015    Male

In [121]:
# 인덱스 값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성
data_df_reset.index = data_df_reset.index + 1

In [122]:
data_df_reset

  oldIndex      Name  Year  Gender
1      one   Chulmin  2011    Male
2      two   Enykung  2016  Female
3    three  Jinwoong  2015    Male
4     four    Seobum  2015    Male

In [123]:
# 다음과 같은 오류 
print(data_df_reset.iloc[0, 1])

Chulmin

#### ValueError: Location based indexing can only have 
[integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [124]:
# 위치 기반 인덱싱이 아닌 명칭을 입력하면 오류 
print(data_df_reset.iloc[0, 'Name'])

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

#### ValueError: Location based indexing can only have 
[integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [125]:
# 문자열 인덱스를 행 위치에 입력해도 오류 발생
data_df.iloc['one', 0]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

#### ValueError: Location based indexing can only have 
[integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [126]:
# 새로운 정수형 인덱스로 변경한 데이터셋에 iloc적용
print(data_df_reset)

  oldIndex      Name  Year  Gender
1      one   Chulmin  2011    Male
2      two   Enykung  2016  Female
3    three  Jinwoong  2015    Male
4     four    Seobum  2015    Male

In [127]:
print(data_df_reset.iloc[0, 1]) # 첫번째 행의 두번째 열 위치에 있는 값
print(data_df_reset.iloc[2, 1])  # 3번째 행의 두번째 열 위치에 있는 값.

Chulmin
Jinwoong

#### DataFrame loc[] 연산자
- 명칭기반 인덱싱을 제공

In [128]:
data_df.loc['one', 'Name']

'Chulmin'

In [129]:
data_df_reset

  oldIndex      Name  Year  Gender
1      one   Chulmin  2011    Male
2      two   Enykung  2016  Female
3    three  Jinwoong  2015    Male
4     four    Seobum  2015    Male

In [30]:
data_df_reset.loc[1, "Name"]

'Chulmin'

In [130]:
# 다음 코드는 오류를 리턴
data_df_reset.loc[0, 'Name']

KeyError: 0

#### KeyError: 0

In [131]:
# 오류가 발생
print('명칭 기반 ix slicing\n', data_df.ix['one':'two', 'Name'])

AttributeError: 'DataFrame' object has no attribute 'ix'

#### AttributeError: 'DataFrame' object has no attribute 'ix'

In [133]:
print(data_df,'\n')
print('위치 기반 iloc slicing \n', data_df.iloc[0:1 , 0], '\n')

           Name  Year  Gender
one     Chulmin  2011    Male
two     Enykung  2016  Female
three  Jinwoong  2015    Male
four     Seobum  2015    Male

위치 기반 iloc slicing
 one    Chulmin
Name: Name, dtype: object

In [134]:
print('명칭 기반 loc slicing \n', data_df.loc["one":"two", "Name"])

명칭 기반 loc slicing
 one    Chulmin
two    Enykung
Name: Name, dtype: object

In [136]:
print(data_df_reset,'\n')
print(data_df_reset.loc[1:2, 'Name'])

  oldIndex      Name  Year  Gender
1      one   Chulmin  2011    Male
2      two   Enykung  2016  Female
3    three  Jinwoong  2015    Male
4     four    Seobum  2015    Male

1    Chulmin
2    Enykung
Name: Name, dtype: object

### 정리
- DataFrame의 인덱스나 칼럼명으로 데이터에 접근하는 것은 명칭기반 인덱스.0부터 시작하는 행, 열의 위치 좌표에만 의존하는 것이 위치 기반 인덱싱
- `ix[]`는 명칭기반 인덱싱과 위치 기반 인덱싱을 모두 적용가능하나 ,데이터프레임의 인덱스가 숫자형일 경우 행 위치에 오는 숫자는 위치 기반 인덱싱이나 숫자는 위치 기반 인덱싱이 아닌 명칭 기반 인덱싱의 데이터프레임 인덱스를 가리킴.(**없어질 API**)
- `iloc`[]는 위치 기반 인덱싱만 가능.따라서 행와 열 위치 값으로 정수형 값을 지정해 원하는 데이터를 반환
- `loc[]`는 명칭 기반 인덱싱만 가능.따라서 행 위치에 DaaFrame인덱스가 오며, 열 위치에는 컬럼명을 지정해 원하는 데이터를 반환합니다.
- 명칭 기반 인덱싱에서 슬라이싱을 `시작점:종료점`으로 지정할 때 시작점에서 종료점을 포함한 위치에 있는 데이터를 반환

#### 불린 인덱싱
- 헛갈리는 위치기반, 명칭기반 인덱싱을 사용 할 필요없이 조건식을 `[]`안에 기입하여 간편하게 필터링을 수행

In [140]:
titanic_df = pd.read_csv('../04.Pandas/data/titanic_train.csv')

In [147]:
var1 =  titanic_df['Age'] > 60
print(type(var1))

<class 'pandas.core.series.Series'>

In [158]:
# 나이가 60이상인 승객의 나이와 이름을 가져오는 방법 1
titanic_df[var1][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [159]:
# 나이가 60이상인 승객의 나이와 이름을 가져오는 방법 2
titanic_df[['Name', 'Age']][var1].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [156]:
# 나이가 60이상인 승객의 나이와 이름을 가져오는 방법 3
titanic_df.loc[var1, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [161]:
# 나이가 60이상이고, 선실 등급이 1등급, 성별이 여성인 승객 추출
cond_age = titanic_df['Age'] >= 60
cond_cabin = titanic_df['Pclass'] == 1
cond_sex = titanic_df['Sex'] == 'female'

titanic_df[cond_age & cond_cabin & cond_sex].head(5)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
366          367         1       1  Warren, Mrs...  female  60.0      1      0  110813  75.2500   D37        C
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [144]:
titanic_boolean = titanic_df[titanic_df['Age'] > 60]  
print(type(titanic_boolean))
display(titanic_boolean)

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

### 정렬, Aggregation 함수, GroupBy적용

#### Aggregation 함수

In [163]:
#NaN값은 count에서 제외
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

#### 특정컬럼들로 Aggregation함수 수행

In [178]:
display(titanic_df[['Age', 'Fare']].mean(axis = 0), titanic_df[['Age', 'Fare']].mean(axis = 1))

Age     29.699118
Fare    32.204208
dtype: float64

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [180]:
titanic_df[['Age','Fare']].sum(axis = 0)

Age     21205.1700
Fare    28693.9493
dtype: float64

In [171]:
titanic_df[['Age', 'Fare']].count()

Age     714
Fare    891
dtype: int64

**`groupby()`** 인자에 Group By하고자 하는 컬럼을 입력, 여러개의 컬럼으로 Group By하고자 하면 `[]`내에 해당 컬럼명을 입력.
DataFrame내에 groupby()를 호출하면 DataFameGroupby객체를 반환

In [183]:
titanic_df_groupby = titanic_df.groupby(by='Pclass')
display(titanic_df_groupby)

In [187]:
# 아래 Pclass가 인덱스로 떨어지는 것을 확인(Groupby된 컬럼)
titanic_groupby = titanic_df_groupby.count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [189]:
display(titanic_groupby.shape, titanic_groupby.index,type(titanic_groupby))

(3, 11)

Int64Index([1, 2, 3], dtype='int64', name='Pclass')

pandas.core.frame.DataFrame

In [193]:
# 특정 컬럼에 대해서 Groupby한 결과를 가져오고 싶다.
titanic_groupby = titanic_df_groupby[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [195]:
titanic_groupby = titanic_df_groupby[['Pclass', 'PassengerId', 'Survived']].count()
titanic_groupby

        Pclass  PassengerId  Survived
Pclass
1          216          216       216
2          184          184       184
3          491          491       491

In [198]:
# 전체 Groupby한 다음에 뽑아내는 것이 불합리하다고 생각한다.
# 그래서 보고자 하는 항목만 뽑아낸다음에 Groupby하고 Aggregation
titanic_df[['Pclass', 'PassengerId', 'Survived']].groupby('Pclass').count()

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [201]:
# Groupby하고자 하는 컬럼이 리스트에 있어야 한다.
titanic_df[['PassengerId', 'Survived']].groupby('Pclass').count()

KeyError: 'Pclass'

In [205]:
display(titanic_df.groupby('Pclass')['Pclass'].count())
display(titanic_df['Pclass'].value_counts())

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

3    491
1    216
2    184
Name: Pclass, dtype: int64

RDBMS의 group by는 select절에 여러개의 aggregation함수를 적용할 수 있음

Select max(Age), min(Age) from titanic_table group by Pclass

판다스는 여러 개의 aggregation함수를 적용 할 수 있도록 agg()함수를 제공

In [208]:
display(titanic_df.groupby('Pclass')['Age'].agg(['max', 'min']))

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

딕셔너리를 이용하여 특정 컬럼에 다양한 집계(Aggregation)함수 적용

In [209]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'}

In [210]:
display(titanic_df.groupby('Pclass').agg(agg_format))

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

### 결손 데이터(Missing Data) 처리

#### `isna`로 결손 데이터 확인
* 데이터프레임의 주어진 컬럼의 값이 NaN인지 여부를 알려줌(True, False)반환

In [216]:
titanic_df.isna().head(n=3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

* 컬럼의 값이 널인 갯수 구하기 - isna()반환 결과에서 sum()을 취하면 컬럼별 널인 갯수를 구할수있다.

In [221]:
np.sum(True), np.sum(False)

(1, 0)

In [217]:
# True인 것은 1, False는 0 -->> SUM을 구하면 갯수가 나온다.
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### `fillna()`로 결손 데이터 대체

In [224]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000', inplace = False)  # 원본 데이터프레임은 변경안함.(변경된 것을 리턴)
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000     None
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833  C000     None
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000     None

In [225]:
# Embarked가 널인것을 'S'로 대체
# Age가 널인것을 mean값으로 처리 
# inplace옵션의 값은 디폴트가 False임
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())

titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### 판다스 apply lambda 이해 - 파이썬 람다식 이해

In [226]:
def get_square(a):
    return a ** 2

print('3의 제곱은 : %d' % get_square(3))

3의 제곱은 : 9

#### 위의 함수를 람다식으로 변환

In [228]:
lambda_square = lambda x:x ** 2
print("3의 제곱은 : %d" % lambda_square(3))

3의 제곱은 : 9

#### 람다식과 map의 결합
- lambda식을 사용시, 여러 개의 값을 입력 인자로 사용해야 할 경우엔, 보통 map()함수를 사용
- 요약하자면, map()함수는 반복가능한 데이터 타입을 인자로 받아 첫번째 인자인 함수 func를 적용한 결과를 iterable한 객체로 리턴한다라고 
이해했다. 그렇다면 아래에서 해보자.

In [229]:
help(map)

Help on class map in module builtins:

class map(object)
 |  map(func, *iterables) --> map object
 |
 |  Make an iterator that computes the function using arguments from
 |  each of the iterables.  Stops when the shortest iterable is exhausted.
 |
 |  Methods defined here:
 |
 |  __getattribute__(self, name, /)
 |      Return getattr(self, name).
 |
 |  __iter__(self, /)
 |      Implement iter(self).
 |
 |  __next__(self, /)
 |      Implement next(self).
 |
 |  __reduce__(...)
 |      Return state information for pickling.
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.

In [235]:
l_test = [1, 2, 3]
result = map(lambda x: x ** 2, l_test)
print("결과 :" ,list(result))

결과 : [1, 4, 9]

In [236]:
result = map(lambda x:x ** 2, l_test)
for i in list(result):
    print(i, end =' ')

1 4 9

cast into **list type** and access the each and every value using **for..loop**

In [238]:
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x:len(x))
titanic_df[['Name', 'Name_len']].head(3)

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22

In [255]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(10)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       child
8  27.000000       Adult
9  14.000000       child

lambda연산자의 함수식은 삼항 연산자의 구문과 유사하다.아래를 보면 if..else구문을 **삼항 연산자**로 변경해본것이다.

**람다식의 구문**과 유사하다고 할 수 있다.
if..else구문만 지원(lambda식의 경우.)

In [244]:
score = 60

if score >= 60:
    message = "Success"
else:
    message = "Failure"
print(message)

Success

In [245]:
message = "Success" if score >= 60 else "Failure"
print(message)

Success

In [247]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: 'child' if x <= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
child       83
Elderly     22
Name: Age_cat, dtype: int64

#### lambda식이 복잡하다면 함수를 고려

In [251]:
def get_category(age):
    '''
    나이의 범주값 리턴
    '''
    result = None
    if age <= 15:
        result = 'Child'
    elif age <= 60:
        result = 'Adult'
    else:
        result = 'Elderly'
    
    return result

In [252]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: get_category(x))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [253]:
# 나이에 따라 세분화된 분률ㄹ 수행하는 함수 생성
def get_category(age):
    if age <= 5: cat = 'baby'
    elif age <= 12: cat = 'Teenage'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
        
    return cat

# lambda식에서 위에서 정의한 get_category()함수를 반환값으로 지정
# get_category(x)는 입력값으로 'Age'컬럼값을 받아서 해당하는 cat반환
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x: get_category(x))

In [256]:
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult

### 정리
* 2차원 데이터 핸들링을 위해서는 판다스를 사용
* 조인, 피벗/언피벗, SQLAlchemy를 알기에는 많은 시간이 필요합니다.
* 지금까지 언급된 핵실 사항에 집중하고,데이터처리를 직접 수행해보면 문제에 부딧힐때마다 판다스의 다양한 API를 찾아서 해결해나가면 판다스에 대한 실력을 더욱 향상시킬수있다